; ==================================================================================================
; Title:      OA_Tools_EN.lng
; Author:     G. Friedrich
; Version:    C.1.0
; Purpose:    ObjAsm OAT_App english language resource UCS-2 encoded file.
; Notes:      Version C.1.0, October 2017
;               - First release.
; ==================================================================================================


STRINGTABLE
LANGUAGE LANG_ENGLISH, SUBLANG_ENGLISH_US
BEGIN
  IDLANG_ENGLISH + IDS_APPLICATION,             "&Application|Application commands"
  IDLANG_ENGLISH + IDS_APPL_SETUP,              "&Setup...~F2|Application setup dialog"
  IDLANG_ENGLISH + IDS_LANGUAGE,                "&Language|Language selection"
  IDLANG_ENGLISH + IDS_LANG_ENGLISH,            "&English|English language"
  IDLANG_ENGLISH + IDS_LANG_GERMAN,             "&Deutsch|Deutsche Sprache"
  IDLANG_ENGLISH + IDS_LANG_SPANISH,            "&Español|Lenguage español"
  IDLANG_ENGLISH + IDS_LANG_CHINESE,            "中文|中文"
  IDLANG_ENGLISH + IDS_APPL_EXIT,               "E&xit...~Alt+F4|Exit the application"

  IDLANG_ENGLISH + IDS_EDIT,                    "&Edit|Edit commands"
  IDLANG_ENGLISH + IDS_EDIT_CUT,                XMENU_CAT_RES(C&ut~Ctrl+X, IDS_HINT_CUT)
  IDLANG_ENGLISH + IDS_EDIT_COPY,               XMENU_CAT_RES(&Copy~Ctrl+C, IDS_HINT_COPY)
  IDLANG_ENGLISH + IDS_EDIT_PASTE,              XMENU_CAT_RES(&Paste~Ctrl+V, IDS_HINT_PASTE)
  IDLANG_ENGLISH + IDS_EDIT_DELETE,             XMENU_CAT_RES(&Delete~Del, IDS_HINT_DELETE)
  IDLANG_ENGLISH + IDS_EDIT_SELECT_ALL,         XMENU_CAT_RES(&Select all~Ctrl+A, IDS_HINT_SELECT_ALL)

  IDLANG_ENGLISH + IDS_OPEN_EDITOR,             XMENU_CAT_RES(&Open external editor, IDS_HINT_OPEN_EDITOR)
  IDLANG_ENGLISH + IDS_COPY_FILENAME,           XMENU_CAT_RES(Copy &file name, IDS_HINT_COPY_FILENAME)
  IDLANG_ENGLISH + IDS_CHECK_AGAIN,             XMENU_CAT_RES(Check a&gain, IDS_HINT_CHECK_AGAIN)

  IDLANG_ENGLISH + IDS_MENU_CHECK,              "&Checks|Source code checks"
  IDLANG_ENGLISH + IDS_MENU_CHECK_MTD,          "Method"
  IDLANG_ENGLISH + IDS_MENU_CHECK_MTD_REG,      "&Registers...|Check the register usage into a method"
  IDLANG_ENGLISH + IDS_MENU_CHECK_MTD_ARG,      "&Arguments...|Check the argument usage into a method"
  IDLANG_ENGLISH + IDS_MENU_CHECK_MTD_LOC,      "&Locals...|Check the locals usage into a method"
  IDLANG_ENGLISH + IDS_MENU_CHECK_MTD_ALL,      "&All...~F5|Perform all method checks"
  IDLANG_ENGLISH + IDS_MENU_CHECK_PRC,          "Procedure"
  IDLANG_ENGLISH + IDS_MENU_CHECK_PRC_REG,      "R&egisters...|Check the register usage into a procedure"
  IDLANG_ENGLISH + IDS_MENU_CHECK_PRC_ARG,      "Ar&guments...|Check the usage of procedure arguments"
  IDLANG_ENGLISH + IDS_MENU_CHECK_PRC_LOC,      "L&ocals...|Check the usage of procedure locals"
  IDLANG_ENGLISH + IDS_MENU_CHECK_PRC_ALL,      "A&ll...~Ctrl+F5|Perform all procedure checks"
  IDLANG_ENGLISH + IDS_MENU_CHECK_MAC,          "Macro"
  IDLANG_ENGLISH + IDS_MENU_CHECK_MAC_ARG,      "Arg&uments...|Check the usage of macro arguments"
  IDLANG_ENGLISH + IDS_MENU_CHECK_MAC_LOC,      "Lo&cals...|Check the usage of macro locals"
  IDLANG_ENGLISH + IDS_MENU_CHECK_MAC_ALL,      "All...~Alt+F5|Perform all macro checks"

  IDLANG_ENGLISH + IDS_TOOL,                    "&Tools|External utilities"

  IDLANG_ENGLISH + IDS_WINDOW,                  "&Window|Window commands"
  IDLANG_ENGLISH + IDS_WINDOW_CASCADE,          XMENU_CAT_RES(&Cascade~Shift+F5, IDS_HINT_CASCADE)
  IDLANG_ENGLISH + IDS_WINDOW_TILE_HOR,         XMENU_CAT_RES(Tile &horizontally, IDS_HINT_TILE_HOR)
  IDLANG_ENGLISH + IDS_WINDOW_TILE_VER,         XMENU_CAT_RES(Tile &vertically~Shift+F4, IDS_HINT_TILE_VER)
  IDLANG_ENGLISH + IDS_WINDOW_ARRANGE,          XMENU_CAT_RES(Arrange &icons, IDS_HINT_ARRANGE)
  IDLANG_ENGLISH + IDS_WINDOW_NEXT,             XMENU_CAT_RES(&Next~Ctrl+F6, IDS_HINT_NEXT)
  IDLANG_ENGLISH + IDS_WINDOW_PREV,             XMENU_CAT_RES(&Previous~Ctrl+Shift+F6, IDS_HINT_PREV)
  IDLANG_ENGLISH + IDS_WINDOW_CLOSE,            XMENU_CAT_RES(&Close~Ctrl+F4, IDS_HINT_CLOSE)
  IDLANG_ENGLISH + IDS_WINDOW_CLOSE_ALL,        XMENU_CAT_RES(Close &all, IDS_HINT_CLOSE)

  IDLANG_ENGLISH + IDS_HELP,                    "&Help|Invokes help"
  IDLANG_ENGLISH + IDS_HELP_SYSINFO,            "System &information...|Launch system information"
  IDLANG_ENGLISH + IDS_HELP_HELP,               "Application &help...~F1|Launch the help system for this application"
  IDLANG_ENGLISH + IDS_HELP_ABOUT,              "&About...~Shift+F1|Display information about this application"

  IDLANG_ENGLISH + IDS_HINT_CUT,                "Cut the selection to the clipboard"
  IDLANG_ENGLISH + IDS_HINT_COPY,               "Copy the selection to the clipboard"
  IDLANG_ENGLISH + IDS_HINT_PASTE,              "Paste the clipboard content"
  IDLANG_ENGLISH + IDS_HINT_DELETE,             "Delete the selection"
  IDLANG_ENGLISH + IDS_HINT_SELECT_ALL,         "Select the whole content"

  IDLANG_ENGLISH + IDS_HINT_CASCADE,            "Cascade all windows"
  IDLANG_ENGLISH + IDS_HINT_TILE_HOR,           "Tile all windows horizontally"
  IDLANG_ENGLISH + IDS_HINT_TILE_VER,           "Tile all windows vertically"
  IDLANG_ENGLISH + IDS_HINT_ARRANGE,            "Arrange all window icons"
  IDLANG_ENGLISH + IDS_HINT_NEXT,               "Move to next window"
  IDLANG_ENGLISH + IDS_HINT_PREV,               "Move to previous window"
  IDLANG_ENGLISH + IDS_HINT_CLOSE,              "Close the active window"
  IDLANG_ENGLISH + IDS_HINT_CLOSE_ALL,          "Close all windows"

  IDLANG_ENGLISH + IDS_HINT_OPEN_EDITOR,        "Open the external editor"
  IDLANG_ENGLISH + IDS_HINT_COPY_FILENAME,      "Copy file name to clipboard"
  IDLANG_ENGLISH + IDS_HINT_CHECK_AGAIN,        "Check the file again"

  IDLANG_ENGLISH + IDS_HINT_ZOOM_IN,            "Zoom in"
  IDLANG_ENGLISH + IDS_HINT_ZOOM_OUT,           "Zoom out"

  IDLANG_ENGLISH + IDS_WORKING,                 "Working"
  IDLANG_ENGLISH + IDS_CHECK_REG_READY,         "Registers check ready."
  IDLANG_ENGLISH + IDS_CHECK_LOC_READY,         "Locals check ready."
  IDLANG_ENGLISH + IDS_CHECK_ARG_READY,         "Arguments check ready."
  IDLANG_ENGLISH + IDS_FILE_EMPTY,              "This file is empty!"
  IDLANG_ENGLISH + IDS_FILE_OPEN_ERROR,         "This file could not be opened!"

  IDLANG_ENGLISH + IDS_SELECT_FILE,             "Select a file..."
  IDLANG_ENGLISH + IDS_SELECT_EDITOR,           "Select an external editor..."
  IDLANG_ENGLISH + IDS_SELECT_TOOL,             "Select a tool..."
  IDLANG_ENGLISH + IDS_INTERNAL_FAILURE,        "Application internal failure!"

  IDLANG_ENGLISH + IDS_DLG_EXIT_CAPTION,        "ObjAsm Tools exit"
  IDLANG_ENGLISH + IDS_DLG_EXIT_QUESTION,       "Are you sure you want to exit?"
  IDLANG_ENGLISH + IDS_DLG_EXIT_YES,            "&Yes"
  IDLANG_ENGLISH + IDS_DLG_EXIT_NO,             "&No"

  IDLANG_ENGLISH + IDS_TAB1_MAIN,               "&Main   "
  IDLANG_ENGLISH + IDS_TAB1_APPLICATION,        "Application"
  IDLANG_ENGLISH + IDS_TAB1_EXTERNAL_EDITOR,    "&External editor:"
  IDLANG_ENGLISH + IDS_TAB1_LINE_TERMINATOR,    "Line teminator:"
  IDLANG_ENGLISH + IDS_TAB1_WINDOW,             "Window"
  IDLANG_ENGLISH + IDS_TAB1_ZOOM_FACTOR,        "&Zoom factor:"
  IDLANG_ENGLISH + IDS_TAB1_FONTFACE_NAME,      "Font &name:"
  IDLANG_ENGLISH + IDS_TAB1_FONT_SIZE,          "Font &size:"
  IDLANG_ENGLISH + IDS_TAB1_CHECKS,             "Checks"
  IDLANG_ENGLISH + IDS_TAB1_CLOSE_NO_FINDINGS,  "Close if no &finding"
  IDLANG_ENGLISH + IDS_TAB1_USE_ANNOTATIONS,    "&Use annotations"
  IDLANG_ENGLISH + IDS_TAB1_MIXED,              "&Both"

  IDLANG_ENGLISH + IDS_TAB2_TOOLS,              "&Tools   "
  IDLANG_ENGLISH + IDS_TAB2_TOOL,               "Tool"
  IDLANG_ENGLISH + IDS_TAB2_NAME,               "Name"
  IDLANG_ENGLISH + IDS_TAB2_COMMAND,            "Command"
  IDLANG_ENGLISH + IDS_TAB2_NOTE,               "Note: append a '$' to the command to pass the file name as argument."

  IDLANG_ENGLISH + IDS_TAB3_COLORS,             "&Colors  "
  IDLANG_ENGLISH + IDS_TAB3_COLOR_NOTIF,        "Notification"
  IDLANG_ENGLISH + IDS_TAB3_COLOR_COMMENT,      "Information"
  IDLANG_ENGLISH + IDS_TAB3_COLOR_FAILIURE,     "Failiure"
  IDLANG_ENGLISH + IDS_TAB3_COLOR_BKGROUND,     "Background"
  IDLANG_ENGLISH + IDS_TAB3_COLOR_REG_ERROR,    "Register error"
  IDLANG_ENGLISH + IDS_TAB3_COLOR_REG_WARNING,  "Register warning"
  IDLANG_ENGLISH + IDS_TAB3_COLOR_ARG_WARNING,  "Argument warning"
  IDLANG_ENGLISH + IDS_TAB3_COLOR_LOC_WARNING,  "Local warning"
  IDLANG_ENGLISH + IDS_TAB3_NOTE,               "Note: Changes will be applied to new windows."

  IDLANG_ENGLISH + IDS_SETUP,                   "Setup"
  IDLANG_ENGLISH + IDS_CANCEL,                  "&Cancel"

  IDLANG_ENGLISH + IDS_CODEBLOCK_NAME,          "  Code block:  "
  IDLANG_ENGLISH + IDS_REGISTERS,               "  Register(s):"
  IDLANG_ENGLISH + IDS_ARGUMENTS,               "  Argument(s):"
  IDLANG_ENGLISH + IDS_LOCALS,                  "  Local(s):   "
  IDLANG_ENGLISH + IDS_REG_WARNING,             "WARNING: possibly unnecessary register preservation detected."
  IDLANG_ENGLISH + IDS_ARG_WARNING,             "WARNING: possibly unused argument(s) detected."
  IDLANG_ENGLISH + IDS_LOC_WARNING,             "WARNING: possibly unused local variable(s) detected."
  IDLANG_ENGLISH + IDS_REG_ERROR,               "ERROR: possibly unpreserved register(s) detected."

  IDLANG_ENGLISH + IDS_SELECTION_FILE_NAME      "Selected file &name:"
  IDLANG_ENGLISH + IDS_SELECTION_OPEN           "&Open"
  IDLANG_ENGLISH + IDS_SELECTION_FILTER_NAME_0  "Assembler files"
  IDLANG_ENGLISH + IDS_SELECTION_FILTER_NAME_1  "Text files"
  IDLANG_ENGLISH + IDS_SELECTION_FILTER_NAME_2  "All files"

  IDLANG_ENGLISH + IDS_ABOUT_CAPTION,           "About this application"
  IDLANG_ENGLISH + IDS_ABOUT_APPLICATION,       "ObjAsm Tools"
  IDLANG_ENGLISH + IDS_ABOUT_VERSION,           "Version "
  IDLANG_ENGLISH + IDS_ABOUT_DESCRIPTION,       "This application is a set of tools to check assembler source code.\nPlease read the instruction manual carefully."
  IDLANG_ENGLISH + IDS_ABOUT_EMAIL,             "ICON_LINK|&Visit our Homepage|http://objasm.x10host.com/"
  IDLANG_ENGLISH + IDS_ABOUT_HOMEPAGE,          "ICON_MAIL|&Send us an Email|mailto:objasm@gmx.net"

  IDLANG_ENGLISH + IDS_TOOL_FILTER_NAME_0       "Executable files"
  IDLANG_ENGLISH + IDS_TOOL_FILTER_NAME_1       "Batch files"
  IDLANG_ENGLISH + IDS_TOOL_FILTER_NAME_2       "Script files"
  IDLANG_ENGLISH + IDS_TOOL_FILTER_NAME_3       "All files"

  IDLANG_ENGLISH + ID_MDI_MORE,                 "&More windows...|Select a window"
  IDLANG_ENGLISH + ID_MDI_LIST,                 "Window list"

  IDLANG_ENGLISH + IDS_DROP_CHECK_MTD,          "Method checks"
  IDLANG_ENGLISH + IDS_DROP_CHECK_MTD_REG,      "&Registers|Check the register usage into a method"
  IDLANG_ENGLISH + IDS_DROP_CHECK_MTD_ARG,      "&Arguments|Check the argument usage into a method"
  IDLANG_ENGLISH + IDS_DROP_CHECK_MTD_LOC,      "&Locals|Check the locals usage into a method"
  IDLANG_ENGLISH + IDS_DROP_CHECK_MTD_ALL,      "&All|Perform all method checks"
  IDLANG_ENGLISH + IDS_DROP_CHECK_PRC,          "Procedure checks"
  IDLANG_ENGLISH + IDS_DROP_CHECK_PRC_REG,      "R&egisters|Check the register usage into a procedure"
  IDLANG_ENGLISH + IDS_DROP_CHECK_PRC_ARG,      "Ar&guments|Check the usage of procedure arguments"
  IDLANG_ENGLISH + IDS_DROP_CHECK_PRC_LOC,      "L&ocals|Check the usage of procedure locals"
  IDLANG_ENGLISH + IDS_DROP_CHECK_PRC_ALL,      "A&ll|Perform all procedure checks"
  IDLANG_ENGLISH + IDS_DROP_CHECK_MAC,          "Macro checks"
  IDLANG_ENGLISH + IDS_DROP_CHECK_MAC_ARG,      "Arg&uments|Check the usage of macro arguments"
  IDLANG_ENGLISH + IDS_DROP_CHECK_MAC_LOC,      "Lo&cals|Check the usage of macro locals"
  IDLANG_ENGLISH + IDS_DROP_CHECK_MAC_ALL,      "All|Perform all macro checks"
END
